Revit 2027 API
PointOnEdgeFaceIntersection.SetEdgeReference Method
Change the edge or curve reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetEdgeReference(
	Reference edgeReference
)
Public Sub SetEdgeReference (
	edgeReference As Reference
)
public:
void SetEdgeReference(
	Reference^ edgeReference
)
member SetEdgeReference :
        edgeReference : Reference -> unit
Parameters
edgeReference Reference
Remarks
The referenced element may be any model element, including FamilyInstance, FormElement, or CurveElement. The reference must be of type ElementReferenceType.REFERENCE_TYPE_LINEAR.
See Also
Reference
PointOnEdgeFaceIntersection Class
Autodesk.Revit.DB Namespace